УТ_для_edt.РасширениеСмарт/src/Reports/ПрайсЛист/ПрайсЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="26a3401d-077d-42ee-92ba-02ec9cc2edb3">
  <name>ПрайсЛист</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Reports/ПрайсЛист/ObjectModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

&ИзменениеИКонтроль("ОпределитьНастройкиФормы")
Процедура смарт_ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки)
	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
	#Вставка     
	//++ #4276 смарт: Тимофеева 09.09.2025 / Добавить в отчет прайс-лист колонку Цена в рублях (расчетная)
	Настройки.События.ПриОпределенииПараметровВыбора = Истина;
    //-- #4276 смарт: Тимофеева 09.09.2025
	#КонецВставки
КонецПроцедуры

Процедура ПриОпределенииПараметровВыбора(Форма, СвойстваНастройки) Экспорт
	
	Если Строка(СвойстваНастройки.ПолеКД) = "ВидЦены" Тогда
		Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыЦен.Ссылка КАК ВидЦены
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	НЕ ВидыЦен.ПометкаУдаления
		|	И НЕ ВидыЦен.Наименование ПОДОБНО ""%[%]%""";
		СвойстваНастройки.ЗапросЗначенийВыбора.Текст = Текст;		
	КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

//++ #4276 смарт: Тимофеева 09.09.2025 / Добавить в отчет прайс-лист колонку Цена в рублях (расчетная)
Процедура смартПрименитьПараметры()
	
	Набор = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	Набор.АвтоЗаполнениеДоступныхПолей = Ложь;
	Набор.Имя = "ЦеныРасчетные";
	Набор.ИсточникДанных = "ИсточникДанных1";
	Набор.Запрос = "ВЫБРАТЬ
	               |	Настройки.ВидЦеныРозничнаяUSD КАК ВидЦены
	               |ПОМЕСТИТЬ ВидыЦенРасчетные
	               |ИЗ
	               |	Справочник.смартПредопределенныеЗначения КАК Настройки
	               |ГДЕ
	               |	Настройки.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.Настройки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	               |	""Расчетная (РУБ)"" КАК ВидЦеныРасчетная,
	               |	ЦеныНоменклатурыСрезПоследних.Цена * КурсыВалютСрезПоследних.Курс / ВЫБОР
	               |		КОГДА КурсыВалютСрезПоследних.Кратность = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ КурсыВалютСрезПоследних.Кратность
	               |	КОНЕЦ КАК ЦенаРасчетная
	               |{ВЫБРАТЬ
	               |	Номенклатура.*,
	               |	Характеристика.*,
	               |	ВидЦеныРасчетная,
	               |	ЦенаРасчетная}
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&Период,
	               |			ВидЦены В
	               |				(ВЫБРАТЬ
	               |					ВидыЦенРасчетные.ВидЦены
	               |				ИЗ
	               |					ВидыЦенРасчетные КАК ВидыЦенРасчетные) 
				   |				И Номенклатура = &Номенклатура И Характеристика = &Характеристика) КАК ЦеныНоменклатурыСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	               |		ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	               |ГДЕ
	               |	ЦеныНоменклатурыСрезПоследних.Цена > 0";
	
	Поле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "ВидЦеныРасчетная";
	Поле.ПутьКДанным = "ВидЦеныРасчетная";
	Поле.Заголовок = "Вид цены расчетная";
	
	Поле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "ЦенаРасчетная";
	Поле.ПутьКДанным = "ЦенаРасчетная";
	Поле.Заголовок = "Цена расчетная";
	Поле.ТипЗначения = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)); 
	
	Связь = СхемаКомпоновкиДанных.СвязиНаборовДанных.Добавить();
	Связь.НаборДанныхИсточник = "ПрайсЛист";
	Связь.НаборДанныхПриемник = "ЦеныРасчетные";
	Связь.ВыражениеИсточник = "Номенклатура";
	Связь.ВыражениеПриемник = "Номенклатура"; 
	Связь.Параметр          = "Номенклатура";
	
	Связь = СхемаКомпоновкиДанных.СвязиНаборовДанных.Добавить();
	Связь.НаборДанныхИсточник = "ПрайсЛист";
	Связь.НаборДанныхПриемник = "ЦеныРасчетные";
	Связь.ВыражениеИсточник = "Характеристика";
	Связь.ВыражениеПриемник = "Характеристика";
	Связь.Параметр          = "Характеристика";

	Итог = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	Итог.Выражение = "Выбор Когда Количество(Различные ЦенаРасчетная) = 1 Тогда Максимум(ЦенаРасчетная) Иначе Неопределено Конец";
	Итог.ПутьКДанным = "ЦенаРасчетная";
	Итог.Группировки.Добавить("Номенклатура");
	
	Итог = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	Итог.Выражение = "0";
	Итог.ПутьКДанным = "ЦенаРасчетная";
	Итог.Группировки.Добавить("Номенклатура Иерархия");
		
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиданных(СхемаКомпоновкиДанных);
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);

КонецПроцедуры 

смартПрименитьПараметры();
//-- #4276 смарт: Тимофеева 09.09.2025
